; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph1 - mode
	infrared0 - mode
	spectrograph3 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star8 - direction
	Star1 - direction
	GroundStation9 - direction
	Star10 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation12 - direction
	GroundStation11 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation11)
	(supports instrument2 spectrograph3)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation9)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon17)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation12)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation11)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon17)
)
(:goal (and
	(pointing satellite0 GroundStation11)
	(pointing satellite1 Star8)
	(have_image Star13 spectrograph3)
	(have_image Planet14 thermograph1)
	(have_image Star15 infrared0)
	(have_image Phenomenon16 thermograph2)
	(have_image Phenomenon17 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (calibrate satellite1 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon17 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon17 instrument5 spectrograph3)
   added: (have_image phenomenon17 spectrograph3)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation11 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 groundstation11)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon16 instrument5 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 3 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
10. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 3 of 7
11. (turn_to satellite0 planet14 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 planet14)
   goals met: 2 of 7
12. (take_image satellite0 planet14 instrument0 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 3 of 7
13. (turn_to satellite0 groundstation11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation11)
   goals met: 4 of 7
14. (turn_to satellite1 star13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star13)
   goals met: 4 of 7
15. (take_image satellite1 star13 instrument5 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 5 of 7
16. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 5 of 7
17. (take_image satellite1 star15 instrument5 infrared0)
   added: (have_image star15 infrared0)
   goals met: 6 of 7
18. (turn_to satellite1 star8 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star8)
   goals met: 7 of 7
